PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
#if defined (CY_IP_MXI3C)

#include "cy_syspm.h"
#include "cy_i3c_ccc.h"
#include <string.h>

#if defined(__cplusplus)
extern "C" {
#endif

/******************************************************************************
 *                              Constants                                     *
 ******************************************************************************/

/**
* \addtogroup group_i3c_macros
* \{
*/

/** Driver major version */
#define CY_I3C_DRV_VERSION_MAJOR    (1U)

/** Driver minor version */
#define CY_I3C_DRV_VERSION_MINOR    (0U)

/** I3C driver identifier */
#define CY_I3C_ID           CY_PDL_DRV_ID(0x75U)

/**
* \addtogroup group_i3c_macros_common_macros Common Macros
* \{
*/

/** Max device address value */
#define CY_I3C_MAX_ADDR CY_I3C_GENMASK(6U, 0U)

/** I3C Broadcast Address */
#define CY_I3C_BROADCAST_ADDR    (0x7EU)

/** payload size position in GETMRL response */
#define CY_I3C_GETMRL_PAYLOAD_SIZE   CY_I3C_BIT(4)

/** \} group_i3c_macros_common_macros */

/**
* \defgroup group_i3c_macros_intr_macros Interrupt Status
* \{
*/

/**
* The number of empty locations in the transmit buffer is greater than or
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_TX_BUFFER_THLD_STS I3C_CORE_INTR_STATUS_TX_THLD_STS_Msk

/**
* The number of elements in the receive buffer is greater than or
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_RX_BUFFER_THLD_STS I3C_CORE_INTR_STATUS_RX_THLD_STS_Msk

/**
* The number of elements in the IBI buffer is greater than or
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_IBI_BUFFER_THLD_STS I3C_CORE_INTR_STATUS_IBI_THLD_STS_Msk

/**
* The number of empty locations in the command queue is greater than or
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_CMD_QUEUE_READY_STS I3C_CORE_INTR_STATUS_CMD_QUEUE_READY_STS_Msk

/**
* The number of elements in the response queue is greater than or
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_RESP_READY_STS I3C_CORE_INTR_STATUS_RESP_READY_STS_Msk

/**
* The transfer is aborted.
*/
#define CY_I3C_INTR_TRANSFER_ABORT_STS I3C_CORE_INTR_STATUS_TRANSFER_ABORT_STS_Msk

/**
* The CCC registers are updated by the I3C Controller through CCC commands.
*/
#define CY_I3C_INTR_CCC_UPDATED_STS I3C_CORE_INTR_STATUS_CCC_UPDATED_STS_Msk

/**
* The dynamic address of the device is assigned through SETDASA or ENTDAA CCC
*/
#define CY_I3C_INTR_DYN_ADDR_ASSGN_STS I3C_CORE_INTR_STATUS_DYN_ADDR_ASSGN_STS_Msk

/**
* Error occurred in the transfer.
*/
#define CY_I3C_INTR_TRANSFER_ERR_STS I3C_CORE_INTR_STATUS_TRANSFER_ERR_STS_Msk

/**
* DEFTGT CCC is received.
*/
#define CY_I3C_INTR_DEFTGT_STS I3C_CORE_INTR_STATUS_DEFTGT_STS_Msk

/**
* The read request is received from the current controller; command queue is empty.
*/
#define CY_I3C_INTR_READ_REQ_RECV_STS I3C_CORE_INTR_STATUS_READ_REQ_RECV_STS_Msk

/**
* The IBI request initiated via TIR request register is addressed and status is updated.
*/
#define CY_I3C_INTR_IBI_UPDATED_STS I3C_CORE_INTR_STATUS_IBI_UPDATED_STS_Msk

/**
* The role of the controller is changed.
*/
#define CY_I3C_INTR_BUSOWNER_UPDATED_STS I3C_CORE_INTR_STATUS_BUSOWNER_UPDATED_STS_Msk

#if CY_IP_MXI3C_VERSION_MINOR == 1u
/**
* Target reset pattern detected.
*/
#define CY_I3C_INTR_TGT_RST_PATTERN_DET_STS I3C_CORE_INTR_STATUS_TGT_RST_PATTERN_DET_STS_Msk
/**
* Provides the list of allowed sources for target mode.
*/
#define CY_I3C_TGT_INTR_Msk (CY_I3C_INTR_CCC_UPDATED_STS | CY_I3C_INTR_DYN_ADDR_ASSGN_STS | \
                             CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_READ_REQ_RECV_STS | \
                             CY_I3C_INTR_IBI_UPDATED_STS | CY_I3C_INTR_TGT_RST_PATTERN_DET_STS | CY_I3C_INTR_BUSOWNER_UPDATED_STS)
#else
/**
* Provides the list of allowed sources for target mode.
*/
#define CY_I3C_TGT_INTR_Msk (CY_I3C_INTR_CCC_UPDATED_STS | CY_I3C_INTR_DYN_ADDR_ASSGN_STS | \
                             CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_READ_REQ_RECV_STS )

#endif

/** \} group_i3c_macros_intr_macros */

/**
* \defgroup group_i3c_macros_controller_status I3C Controller Status
* Macros to check current I3C controller status returned by
* \ref Cy_I3C_GetBusStatus function. Each I3C controller status is encoded
* in a separate bit, therefore multiple bits may be set to indicate the
* current status.
* \{
*/

/**
* The controller is busy executing operation started by \ref Cy_I3C_SendCCCCmd or
* \ref Cy_I3C_ControllerRead or \ref Cy_I3C_ControllerWrite or \ref Cy_I3C_ControllerStartEntDaa
* \ref Cy_I3C_ControllerSendHdrCmds.
*/
#define CY_I3C_CONTROLLER_BUSY                          (0x00010000UL)

/**
* The controller has currently performed a broadcast CCC write transfer
*/
#define CY_I3C_CONTROLLER_BROADCAST_CCC_WR_XFER         (0x00000001UL)

/**
* The controller has currently performed a directed CCC write transfer
*/
#define CY_I3C_CONTROLLER_DIRECTED_CCC_WR_XFER          (0x00000002UL)

/**
* The controller has currently performed a broadcast CCC read transfer
*/
#define CY_I3C_CONTROLLER_DIRECTED_CCC_RD_XFER          (0x00000004UL)

/**
* The controller has currently performed DAA
*/
#define CY_I3C_CONTROLLER_ENTDAA_XFER                   (0x00000008UL)

/**
* The controller has currently performed a private SDR write to an I3C Target
*/
#define CY_I3C_CONTROLLER_I3C_SDR_WR_XFER               (0x00000010UL)

/**
* The controller has currently performed a private SDR read from an I3C Target
*/
#define CY_I3C_CONTROLLER_I3C_SDR_RD_XFER               (0x00000020UL)

/**
* The controller has currently performed a private SDR read to an I2C Target
*/
#define CY_I3C_CONTROLLER_I2C_SDR_WR_XFER               (0x00000040UL)

/**
* The controller has currently performed a private SDR read from an I2C Target
*/
#define CY_I3C_CONTROLLER_I2C_SDR_RD_XFER               (0x00000080UL)

/**
* The controller has currently performed a private HDR write in DDR mode
*/
#define CY_I3C_CONTROLLER_HDR_DDR_WR_XFER               (0x00000100UL)

/**
* The controller has currently performed a private HDR read in DDR mode
*/
#define CY_I3C_CONTROLLER_HDR_DDR_RD_XFER               (0x00000200UL)

/**
* The controller has currently responded to a IBI request
*/
#define CY_I3C_CONTROLLER_IBI_XFER                      (0x00000400UL)

/**
* The controller is in HALT state due to error in the transfer
*/
#define CY_I3C_CONTROLLER_HALT_STATE                    (0x00000800UL) //This is the BUS_ERR - Ask

/**
* The transaction was aborted
*/
#define CY_I3C_CONTROLLER_XFER_ABORTED                  (0X00001000UL)

/** \} group_i3c_macros_controller_status */

/**
* \defgroup group_i3c_macros_target_status I3C Target Status
* Macros to check current I3C target status returned by
* \ref Cy_I3C_GetBusStatus function. Each I3C target status is encoded
* in a separate bit, therefore multiple bits may be set to indicate the
* current status.
*
* \note
* I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
* \{
*/

/**
* The controller has finished reading data from the target
*/
#define CY_I3C_TARGET_RD_CMPLT      (0x00002000UL)

/**
* The controller has finished writing data into the target
*/
#define CY_I3C_TARGET_WR_CMPLT      (0x00004000UL)

