PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
/** There is a read transaction in progress */
#define CY_I3C_TARGET_RD_BUSY       (0x00008000UL)

/** There is a write transaction in progress */
#define CY_I3C_TARGET_WR_BUSY       (0x00010000UL)

/** \} group_i3c_macros_target_status */

/**
* \defgroup group_i3c_macros_callback_events I3C Callback Events
* \{
* Macros to check I3C events passed by \ref cy_cb_i3c_handle_events_t callback.
* Each event is encoded in a separate bit, and therefore it is possible to
* notify about multiple events.
*/

/** The controller write started by \ref Cy_I3C_ControllerWrite is complete */
#define CY_I3C_CONTROLLER_WR_CMPLT_EVENT       (0x00000001UL)

/** The controller read started by \ref Cy_I3C_ControllerRead is complete */
#define CY_I3C_CONTROLLER_RD_CMPLT_EVENT       (0x00000002UL)

/** CY_I3C_CONTROLLER_WR_EARLY_TERMINATION_EVENT */
#define CY_I3C_CONTROLLER_WR_EARLY_TERMINATION_EVENT   (0x00000004UL)

/**
* Indicates the I3C hardware has detected an error.
*/

/** CY_I3C_CRC_ERROR_EVENT */
#define CY_I3C_CRC_ERROR_EVENT                    (0x00000008UL)
/** CY_I3C_PARITY_ERROR_EVENT */
#define CY_I3C_PARITY_ERROR_EVENT                 (0x00000010UL)
/** CY_I3C_FRAME_ERROR_EVENT */
#define CY_I3C_FRAME_ERROR_EVENT                  (0x00000020UL)
/** CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT */
#define CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT    (0x00000040UL)
/** CY_I3C_ADDR_NACK_ERROR_EVENT */
#define CY_I3C_ADDR_NACK_ERROR_EVENT              (0x00000080UL)
/** CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT */
#define CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT        (0x00000100UL)
/** CY_I3C_XFER_ABORTED_ERROR_EVENT */
#define CY_I3C_XFER_ABORTED_ERROR_EVENT           (0x00000200UL)
/** CY_I3C_I2C_TGT_WDATA_NACK_ERROR_EVENT */
#define CY_I3C_I2C_TGT_WDATA_NACK_ERROR_EVENT     (0x00000400UL)
/** CY_I3C_CONTROLLER_EARLY_TERMINATION_EVENT */
#define CY_I3C_CONTROLLER_EARLY_TERMINATION_EVENT (0x00000800UL)
/** CY_I3C_CONTROLLER_ERROR_CE0_EVENT */
#define CY_I3C_CONTROLLER_ERROR_CE0_EVENT         (0X00001000UL)

/** CY_I3C_CONTROLLER_ERR_EVENT */
#define CY_I3C_CONTROLLER_ERR_EVENT               (CY_I3C_CRC_ERROR_EVENT| CY_I3C_PARITY_ERROR_EVENT| CY_I3C_FRAME_ERROR_EVENT| \
                                                   CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT| CY_I3C_ADDR_NACK_ERROR_EVENT| CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT| \
                                                   CY_I3C_XFER_ABORTED_ERROR_EVENT| CY_I3C_I2C_TGT_WDATA_NACK_ERROR_EVENT| CY_I3C_CONTROLLER_ERROR_CE0| CY_I3C_PEC_ERROR_EVENT)

/** CY_I3C_TARGET_ERR_EVENT */
#define CY_I3C_TARGET_ERR_EVENT                   (CY_I3C_CRC_ERROR_EVENT| CY_I3C_PARITY_ERROR_EVENT| CY_I3C_FRAME_ERROR_EVENT| \
                                                   CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT | CY_I3C_CONTROLLER_EARLY_TERMINATION_EVENT | CY_I3C_PEC_ERROR_EVENT)

/** The target device is assigned a dynamic address through SETDASA or ENTDAA or SETAASA CCC from the controller */
#define CY_I3C_TARGET_ASSIGNED_DYN_ADDR_EVENT     (0X00002000UL)

/**
* The controller has read all data out of the configured Read buffer.
* This event can be used to configure the next Read buffer. If the buffer
* remains empty, the CY_I3C_DEFAULT_TX bytes are returned to the controller.
*/

/** CY_I3C_TARGET_WR_BUFFER_NOT_CONFIGURED */
#define CY_I3C_TARGET_WR_BUFFER_NOT_CONFIGURED    (0x00004000UL)
/** CY_I3C_TARGET_MAX_RD_LEN_UPDT_EVENT */
#define CY_I3C_TARGET_MAX_RD_LEN_UPDT_EVENT       (0X00008000UL)
/** CY_I3C_TARGET_MAX_WR_LEN_UPDT_EVENT */
#define CY_I3C_TARGET_MAX_WR_LEN_UPDT_EVENT       (0X00010000UL)
/**
* Indicates the controller completed reading from the target (set by the controller NAK
* or Stop)
*/
#define CY_I3C_TARGET_RD_CMPLT_EVENT              (0x00020000UL)
/**
* Indicates the controller completed writing to the target (set by the controller Stop
* or Restart)
*/
#define CY_I3C_TARGET_WR_CMPLT_EVENT              (0x00040000UL)
/** One of the CCC register is updated by I3C Controller through CCC commands */
#define CY_I3C_TARGET_CCC_REG_UPDATED_EVENT       (0x00080000UL)
/** There is no valid command in the command queue */
#define CY_I3C_TARGET_NO_VALID_CMD_IN_CMDQ_EVENT  (0x00100000UL)
/**
* The data in Tx FIFO is not equal to the data length size of the command
* or the TX_START_THLD value or the Response queue is full
*/
#define CY_I3C_TARGET_DATA_NOT_READY_EVENT        (0x00200000UL)
/** DEFTGTS CCC is received */
#define CY_I3C_DEFTGT_EVENT                       (0x00400000UL)
/** Role of the controller changed from Controller to Target or vice-versa */
#define CY_I3C_CONTROLLER_ROLE_UPDATED_EVENT      (0x00800000UL)
/** Target reset pattern detected */
#define CY_I3C_TARGET_RESET_EVENT                 (0x01000000UL)
/** IBI not attempted by target as bus might be busy.*/
#define CY_I3C_TARGET_IBI_NOT_ATTEMPTED_EVENT     (0x02000000UL)
/** IBI Acknowledged by controller*/
#define CY_I3C_TARGET_IBI_ACKNOWLEDGED_EVENT      (0x04000000UL)
/** Controllership request accepted */
#define CY_I3C_TARGET_CR_ACCEPTED_EVENT           (0x04000000UL)
/** FOR TIR with data controller terminated before reading all the data */
#define CY_I3C_TARGET_IBI_EARLY_STOP_EVENT        (0x08000000UL)

/** PEC Error event*/
#define CY_I3C_PEC_ERROR_EVENT                    (0x10000000UL)


/** \} group_i3c_macros_callback_events */

/** \cond INTERNAL */

/* I3C Address slot mask */
#define CY_I3C_ADDR_SLOT_STATUS_MASK       3UL

/* COMMAND_QUEUE_PORT Register */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_Pos 0UL
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_Msk 0x7UL
/* Transfer Command Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD 0x0UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID_Pos 3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID_Msk 0x78UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD_Pos 7UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD_Msk 0x7F80UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Pos 15UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Msk 0x8000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX_Msk 0x1F0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED_Pos 21UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED_Msk 0xE00000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DBP_Pos 25UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DBP_Msk 0x2000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Pos 26UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk 0x4000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Pos 27UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Msk 0x8000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Pos 28UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk 0x10000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TGT_RST_Pos 29UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TGT_RST_Msk 0x20000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Pos 30UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk 0x40000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Pos 31UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_PEC_Msk 0x80000000UL
/* Transfer Argument Command Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG 0x01UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DB_Pos 8UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DB_Msk 0xFF00UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH_Msk 0xFFFF0000UL
/* Short Data Argument Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_SHORT_DATA_ARG 0x02UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB_Pos 3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB_Msk 0x38UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0_Pos 8UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0_Msk 0xFF00UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_1_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_1_Msk 0xFF0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_2_Pos 24UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_2_Msk 0xFF000000UL
/* To select the valid data bytes of the Short Data Argument */
#define CY_I3C_BYTE_STROBE1 1U
#define CY_I3C_BYTE_STROBE2 3U
#define CY_I3C_BYTE_STROBE3 7U
/* Address Assignment Command Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_ADDR_ASSGN_CMD 0x03UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TID_Pos 0x3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TID_Msk 0x78UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD_Pos 7UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD_Msk 0x7F80UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX_Msk 0x1F0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT_Pos 21UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT_Msk 0x3E00000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Pos 26UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Msk 0x4000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Pos 30UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Msk 0x40000000UL
/*Target Mode Transmit Command Structure*/
#define I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_DATA_LENGTH_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_DATA_LENGTH_Msk 0xFFFF0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_TID_Pos 3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_TID_Msk 0x0000038UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_ATTR_Pos 0UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TARGET_TRANSMIT_ATTR_Msk 0x00000007UL


/*  RESPONSE_QUEUE_PORT Register  */
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Pos 0UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk 0xFFFFUL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_CCCT_Pos 16UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_CCCT_Msk 0xFF0000UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_TID_Pos 24UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_TID_Msk 0xF000000UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS_Pos 28UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ERR_STS_Msk 0xF0000000UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_CRC_ERROR 0x1UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_PARITY_ERROR 0x2UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_FRAME_ERROR 0x3UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_BROADCAST_ADDR_NACK_ERROR 0x4UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_ADDR_NACK_ERROR 0x5UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_BUFFER_OVERFLOW_ERROR 0x6UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_XFER_ABORTED_ERROR 0x8UL
#define I3C_CORE_CONTROLLER_RESPONSE_QUEUE_PORT_I2C_TGT_WDATA_NACK_ERROR 0x9UL


#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_LSB_Pos 0UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_LSB_Msk 0xFFUL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_Pos 0UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk 0xFFFFUL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DEFINING_BYTE_Pos 8UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_DEFINING_BYTE_Msk 0xFF00UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER_Pos 16UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER_Msk 0xFF0000UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_TID_Pos 24UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_TID_Msk 0x7000000UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_RX_RSP_Pos 27UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_RX_RSP_Msk 0x8000000UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_ERR_STS_Pos 28UL
#define I3C_CORE_TARGET_RESPONSE_QUEUE_PORT_ERR_STS_Msk 0xF0000000UL

/* BCR Register */
#define CY_I3C_CORE_BCR_DEVICE_ROLE_Msk            (0xC0U)
#define CY_I3C_CORE_BCR_I3C_TARGET                 (0U << 6U)
#define CY_I3C_CORE_BCR_I3C_CONTROLLER             (1U << 6U)
#define CY_I3C_CORE_BCR_HDR_CAP_Msk                (0x20U)
#define CY_I3C_CORE_BCR_BRIDGE_Msk                 (0x10U)
#define CY_I3C_CORE_BCR_OFFLINE_CAP_Msk            (0x08U)
#define CY_I3C_CORE_BCR_IBI_PAYLOAD_Msk            (0x04U)
#define CY_I3C_CORE_BCR_IBI_REQ_CAP_Msk            (0x02U)
#define CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk     (0x01U)

/* LVR register */
#define CY_I3C_LVR_LEGACY_I2C_INDEX_MASK        (0xE0U)
#define CY_I3C_LVR_I2C_MODE_INDICATOR            (0x10U)

