PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
/* Dev Operation Mode values */
#define I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_CONTROLLER   (0x0U)
#define I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE_TARGET    (0x1U)

/*Asynchronous timing control commands*/
#define CY_I3C_ENTER_ASYNC_MODE0   (0xDF)
#define CY_I3C_EXIT_ASYNC_MODES   (0xFF)

/* IBI Identifiers */
#define CY_I3C_HOT_JOIN_ADDR                        (0x02U)
#define CY_I3C_IBI_QUEUE_IBI_ADDR(x)                ((x) >> 1U)
#define CY_I3C_IBI_TYPE_HOT_JOIN(x)                    (CY_I3C_IBI_QUEUE_IBI_ADDR((x)) == CY_I3C_HOT_JOIN_ADDR && !((bool)((x) & CY_I3C_BIT(0U))))
#define CY_I3C_IBI_TYPE_CONTROLLERSHIP_REQUEST(x)        (CY_I3C_IBI_QUEUE_IBI_ADDR((x)) != CY_I3C_HOT_JOIN_ADDR && !((bool)((x) & CY_I3C_BIT(0U))))
#define CY_I3C_IBI_TYPE_TIR_REQUEST(x)                (CY_I3C_IBI_QUEUE_IBI_ADDR((x)) != CY_I3C_HOT_JOIN_ADDR && ((bool)((x) & CY_I3C_BIT(0U))))
#define CY_I3C_IBI_TIR_REQ_ID(x)                    ((((x) & CY_I3C_GENMASK(6U, 5U)) >> 5U) + ((x) & CY_I3C_GENMASK(4U, 0U)))

/* IBI Completion Status */
#define I3C_CORE_TGT_INTR_REQ_IBI_STS_IBI_ACK_BY_CONTROLLER       (0x1U)
#define I3C_CORE_TGT_INTR_REQ_IBI_STS_IBI_EARLY_TERMINATE_BY_CONTROLLER  (0x2U)
#define I3C_CORE_TGT_INTR_REQ_IBI_STS_IBI_NOT_ATTEMPTED       (0x3U)

/* Interrupt Mask */
#if CY_IP_MXI3C_VERSION_MINOR == 0u
#define CY_I3C_INTR_MASK ( I3C_CORE_INTR_STATUS_EN_TX_THLD_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_RX_THLD_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_IBI_THLD_STS_EN_Msk    | \
                           I3C_CORE_INTR_STATUS_EN_CMD_QUEUE_READY_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_RESP_READY_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_TRANSFER_ABORT_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_CCC_UPDATED_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_DYN_ADDR_ASSGN_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_TRANSFER_ERR_STS_EN_Msk    | \
                           I3C_CORE_INTR_STATUS_EN_DEFTGT_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_READ_REQ_RECV_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_IBI_UPDATED_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_BUSOWNER_UPDATED_STS_EN_Msk )
#else
#define CY_I3C_INTR_MASK ( I3C_CORE_INTR_STATUS_EN_TX_THLD_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_RX_THLD_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_IBI_THLD_STS_EN_Msk    | \
                           I3C_CORE_INTR_STATUS_EN_CMD_QUEUE_READY_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_RESP_READY_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_TRANSFER_ABORT_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_CCC_UPDATED_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_DYN_ADDR_ASSGN_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_TRANSFER_ERR_STS_EN_Msk    | \
                           I3C_CORE_INTR_STATUS_EN_DEFTGT_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_READ_REQ_RECV_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_IBI_UPDATED_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_BUSOWNER_UPDATED_STS_EN_Msk | \
                           I3C_CORE_INTR_STATUS_TGT_RST_PATTERN_DET_STS_Msk )
#endif

/* I3C states */
#define CY_I3C_IDLE              (0x10000000UL)
#define CY_I3C_IDLE_MASK         (0x10000000UL)

/* Controller states */
#define CY_I3C_CONTROLLER_ACTIVE     (0X00100000UL)
#define CY_I3C_CONTROLLER_RX         (0x00100001UL)
#define CY_I3C_CONTROLLER_TX         (0x00100002UL)

/* Target states */
#define CY_I3C_TARGET_ACTIVE      (0x00001000UL)
#define CY_I3C_TARGET_RX          (0x00001001UL)
#define CY_I3C_TARGET_TX          (0x00001002UL)

/* FIFO size */
#define CY_FIFO_SIZE              (256UL)

#define CY_I3C_FIFO_SIZE           CY_FIFO_SIZE
#define CY_I3C_HALF_FIFO_SIZE     (CY_FIFO_SIZE / 2UL)

#define CY_I3C_DEFAULT_RETURN    (0xFFUL)

/* Convert the timeout in milliseconds to microseconds */
#define CY_I3C_CONVERT_TIMEOUT_TO_US(timeoutMs)     ((timeoutMs) * 1000UL)

/* I3C data rates */
#define CY_I3C_SDR_DATA_RATE            (12500000U)
#define CY_I3C_SDR1_DATA_RATE            (8000000U)
#define CY_I3C_SDR2_DATA_RATE            (6000000U)
#define CY_I3C_SDR3_DATA_RATE            (4000000U)
#define CY_I3C_SDR4_DATA_RATE            (2000000U)
#define CY_I3C_HDRDDR_DATA_RATE            (25000000U)
#define CY_I3C_BUS_I2C_FM_TLOW_MIN_NS    (1300U)
#define CY_I3C_BUS_I2C_FMP_TLOW_MIN_NS    (500U)
#define CY_I3C_BUS_THIGH_MAX_NS            (41U)
#define CY_I3C_SCL_I3C_TIMING_CNT_MIN    (5U)
#define CY_I3C_BUS_TLOW_OD_MIN_NS        (200U) /* minimum low period is 200ns */


/* I2C data rates max (Hz): standard, fast and fast plus modes */
#define CY_I3C_I2C_FM_DATA_RATE    (400000U)
#define CY_I3C_I2C_FMP_DATA_RATE   (1000000U)

#define CY_I3C_IS_MODE_VALID(mode)      ((CY_I3C_TARGET  == (mode)) || \
                                          (CY_I3C_CONTROLLER == (mode)))
#define CY_I3C_IS_BUS_MODE_VALID(mode)                 ((CY_I3C_BUS_PURE  == (mode)) || \
                                                         (CY_I3C_BUS_MIXED_FAST == (mode)) || \
                                                         (CY_I3C_BUS_MIXED_SLOW == (mode)))
#define CY_I3C_IS_BUFFER_DEPTH_VALID(buffer_depth)      ((CY_I3C_1_WORD_DEPTH  == (buffer_depth)) || \
                                                          (CY_I3C_4_WORD_DEPTH == (buffer_depth)) || \
                                                          (CY_I3C_8_WORD_DEPTH == (buffer_depth)) || \
                                                          (CY_I3C_16_WORD_DEPTH == (buffer_depth)) || \
                                                          (CY_I3C_32_WORD_DEPTH == (buffer_depth)) || \
                                                          (CY_I3C_64_WORD_DEPTH == (buffer_depth)))
#define CY_IS_I3C_ADDR_NOT_RESERVED(addr)               (0U != (((8U <= (addr)) &&((addr) <= 61U)) || ((63U <= (addr)) &&((addr) <= 93U)) || \
                                                                 ((95U <= (addr)) && ((addr) <= 109U)) || ((111U <= (addr)) &&((addr) <= 117U))|| \
                                                                 (119U == (addr))))
/* IC_xxx_BUF_DEPTH - 1 = 0xF */
#define CY_IS_I3C_QUEUE_THLD_VALID(thld)              ((thld) <= 0xFUL)
#define CY_IS_I3C_IBI_DATA_THLD_VALID(thld)           ((thld) <= 0xFUL && (thld) >= 0x1UL)
#define CY_IS_I3C_SDA_HOLD_TIME_VALID(time)           ((time) <= 0x7U)
#define CY_IS_I3C_BUS_FREE_TIME_VALID(time)           ((time) <= 0xFFFFU)
#define CY_IS_I3C_OD_CLK_CNT_VALID(cnt)               ((cnt) <= 0xFFU)
#define CY_IS_I3C_PP_CLK_CNT_VALID(cnt)               ((cnt) <= 0xFFU)
#define CY_IS_I2C_CLK_CNT_VALID(cnt)                  ((cnt) <= 0xFFU)
#define CY_IS_I3C_EXT_LCNT_VALID(cnt)                 ((cnt) <= 0xFFU)
#define CY_IS_I3C_EXT_TERMINATION_LCNT_VALID(cnt)     ((cnt) <= 0xFU)

#define CY_IS_I3C_STATIC_ADDRESS_VALID(addr)          ((addr) < 0x7FU)
#define CY_IS_I3C_PID_VALID(pid)                      ((pid) <= 0xFFFFFFFFFFFFU)
#define CY_IS_I3C_DCR_VALID(dcr)                      ((dcr) <= 0xFFU)

#define CY_IS_I3C_DEVICE_ROLE_CAP_VALID(devRole)      ((CY_I3C_TARGET == (devRole)) || (CY_I3C_SECONDARY_CONTROLLER == (devRole)))

#define CY_IS_I3C_BUS_AVAIL_TIME_VALID(time)          ((time) <= 0xFFFFU)
#define CY_IS_I3C_BUS_IDLE_TIME_VALID(time)           ((time) <= 0xFFFFFU)

#define CY_I3C_INTR_VALID(intr, mask)                 (0UL == ((intr) & ((uint32_t) ~(mask))))

#define CY_I3C_IS_SDR_DATA_RATE_VALID(dataRateHz)     (((dataRateHz) > 0UL) && \
                                                      ((dataRateHz) <= CY_I3C_SDR_DATA_RATE))

#define CY_I3C_IS_HDR_DATA_RATE_VALID(dataRateHz)     (((dataRateHz) > 0UL) && \
                                                        ((dataRateHz) <= CY_I3C_HDRDDR_DATA_RATE))

#define CY_I3C_IS_TIMEOUT_VALID(timeoutMs)              ((timeoutMs) <= (0xFFFFFFFFUL / 1000UL))

