PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
#define CY_IS_I3C_ADDR_VALID(addr)              ((0U == ((addr) & 0x80U)))

#define CY_IS_I3C_BUFFER_VALID(buffer, size)    ( (NULL != (buffer)) && ((size) > 0UL) )

#define CY_I3C_IS_BUFFER_SIZE_VALID(size)      (((size) > 0UL) && \
                                                 ((size) <= CY_I3C_FIFO_SIZE) )


/* Default Values */

#define I3C_CORE_QUEUE_THLD_CTRL_DEF_VAL  (_VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, 1UL) | \
                                           _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, 1UL) | \
                                           _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD, 1UL))

#define I3C_CORE_DATA_BUFFER_THLD_CTRL_DEF_VAL (_VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD, 1UL) | \
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, 1UL) | \
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD, 1UL) | \
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD, 1UL))

#define MAX_I3C_TRANSACTION_TIMEOUT (5000000U)

#define MAX_I3C_DATA_LENGTH (I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH_Msk >> I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH_Pos)

/** \endcond */

/** \} group_i3c_macros */

/*******************************************************************************
*                            Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_i3c_enums
* \{
*/

/** I3C status codes */
typedef enum
{
    /** Operation completed successfully */
    CY_I3C_SUCCESS = 0U,

    /** One or more of input parameters are invalid */
    CY_I3C_BAD_PARAM = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 1U),

    /**
    * The controller is not ready to start a new transaction.
    * Either the controller is still processing a previous transaction or in the
    * controller-target mode, the target operation is in progress.
    */
    CY_I3C_CONTROLLER_NOT_READY = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 2U),

    /**
    * The controller failed to attach the target device to the bus
    * as there already exists maximum number of devices on the bus.
    */
    CY_I3C_CONTROLLER_MAX_DEVS_PRESENT = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 3U),

    /**
    * The controller rejected to attach an I2C device without 50ns Spike filter.
    */
    CY_I3C_CONTROLLER_BAD_I2C_DEVICE = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 4U),

    /**
    * Unsupported CCC command
    */
    CY_I3C_CONTROLLER_CCC_NOT_SUPPORTED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 5U),

    /**
    * SDR Controller Error Code CE0 for Illegally formatted CCC Response
    */
    CY_I3C_CONTROLLER_ERROR_CE0 = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 6U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * CRC Error
    */
    CY_I3C_CONTROLLER_CRC_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 7U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * Parity Error
    */
    CY_I3C_CONTROLLER_PARITY_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 8U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * Frame Error
    */
    CY_I3C_CONTROLLER_FRAME_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 9U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * Broadcast Address NACK Error
    */
    CY_I3C_CONTROLLER_BROADCAST_ADDR_NACK_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 10U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * Address NACK Error - Target NACKs for the dynamic address assignment during
    * ENTDAA process.
    */
    CY_I3C_CONTROLLER_ADDR_NACK_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 11U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * TX/RX Buffer Overflow Error - Only for HDR Transfers
    */
    CY_I3C_CONTROLLER_BUFFER_OVERFLOW_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 12U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * Transfer Aborted Error
    */
    CY_I3C_CONTROLLER_XFER_ABORTED_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 13U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * I2C Target Write Data NACK Error
    */
    CY_I3C_CONTROLLER_I2C_TGT_WDATA_NACK_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 14U),

    /** The controller NACKed the IBI */
    CY_I3C_CONTROLLER_IBI_NACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 15U),

    /** The controller ACKed the Controllership Request IBI */
    CY_I3C_CONTROLLER_MR_IBI_ACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 16U),

    /** The controller ACKed the Target Interrupt Request IBI */
    CY_I3C_CONTROLLER_SIR_IBI_ACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 17U),

    /** The controller ACKed the Hot-join IBI */
    CY_I3C_CONTROLLER_HOTJOIN_IBI_ACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 18U),

    /** Free address unavailable */
    CY_I3C_CONTROLLER_FREE_ADDR_UNAVIAL = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 19U),

    /** The device is not HDR capable */
    CY_I3C_NOT_HDR_CAP = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 20U),

    /** The buffer size is greater than the FIFO size */
    CY_I3C_BAD_BUFFER_SIZE = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 21U),

    /** The secondary controller responded with incorrect address to GETACCCR CCC */
    CY_I3C_ADDR_MISMATCH = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 22U),

    /** The device is not yet assigned a dynamic address */
    CY_I3C_ADDR_INVALID = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 23U),

    /** In Target mode of operation, the Controller has disabled TIR through DISEC */
    CY_I3C_SIR_DISABLED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 24U),

    /** In Target mode of operation, the Controller has disabled MR through DISEC */
    CY_I3C_CR_DISABLED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 25U),

    /** The Target device failed to issue IBI */
    CY_I3C_IBI_NOT_ATTEMPTED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 26U),

    /** There are no secondary controller devices on the bus */
    CY_I3C_NO_SECONDARY_CONTROLLER_DEVICES = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 27U),

    /** The target device requested generation of hot-join event generation */ //tbd - provide more clarity in the comment
    CY_I3C_BAD_EVENT_REQ = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 28U),

