PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
    /** The device is not a secondary controller */
    CY_I3C_NOT_SECONDARY_CONTROLLER = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 29U),

    /** No response was received, connection timeout */
    CY_I3C_TIMEOUT = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 30U),

    /**
    * Error Type of the processed command received in Response Data Structure:
    * PEC Error
    */
    CY_I3C_CONTROLLER_PEC_ERROR = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 31U),

} cy_en_i3c_status_t;

/** I3C Operation Modes
*
* \note
*I3C supports only Primary Controller mode in PSE84A0. Secondary controller mode and Target mode are supported in PSE84B0.
*
*/
typedef enum
{
    CY_I3C_TARGET                   = 0U,    /**< Configures I3C for Target operation */
    CY_I3C_SECONDARY_CONTROLLER        = 1U,    /**< Configures I3C for Secondary Controller operation */
    CY_I3C_CONTROLLER                  = 2U,    /**< Configures I3C for Main Controller-operation */
} cy_en_i3c_mode_t;

/** I3C Bus Modes */
typedef enum
{
    CY_I3C_BUS_PURE,        /**< Only I3C devices are connected to the bus. No limitation expected */
    CY_I3C_BUS_MIXED_FAST,  /**< I2C devices with 50ns spike filter are present on the bus.
                                 High SCL pulse has to stay below 50ns when transmitting I3C frames */
    CY_I3C_BUS_MIXED_SLOW,  /**< I2C devices without 50ns spike filter are present on the bus */
    CY_I3C_BUS_MODE_NOT_APPLICABLE,  /**< Only for I3C Target configuration */
} cy_en_i3c_bus_mode_t;

/** I3C Address Slot Statuses */
typedef enum
{
    CY_I3C_ADDR_SLOT_FREE,              /**< Address is free */
    CY_I3C_ADDR_SLOT_RSVD,              /**< Address is reserved */
    CY_I3C_ADDR_SLOT_I2C_DEV,           /**< Address is assigned to an I2C device */
    CY_I3C_ADDR_SLOT_I3C_DEV,           /**< Address is assigned to an I3C device */
} cy_en_i3c_addr_slot_status_t;


/** I3C IBI Types */
typedef enum
{
    CY_I3C_IBI_HOTJOIN,                 /**< IBI Hot join Request */
    CY_I3C_IBI_SIR,                     /**< IBI Target Interrupt Request */
    CY_I3C_IBI_CONTROLLER_REQ,          /**< IBI Controller ownership Request */
} cy_en_i3c_ibi_type_t;

/** I3C Transaction IDs for HDR and SDR commands */
typedef enum
{
    CY_I3C_CONTROLLER_SDR_WRITE_TID  = 1U,     /**< TID for SDR Write Transfer */
    CY_I3C_CONTROLLER_SDR_READ_TID   = 2U,    /**< TID for SDR Read Transfer */
    CY_I3C_CONTROLLER_HDR_WRITE_TID  = 3U,    /**< TID for HDR Write Transfer */
    CY_I3C_CONTROLLER_HDR_READ_TID   = 4U,    /**< TID for HDR Read Transfer */
} cy_en_i3c_tid_t;

/** I3C Mode, SDR and HDR transfer speeds */
typedef enum
{
    CY_I3C_SDR0     = 0U,         /**< I3C mode transfer speed - SDR0*/
    CY_I3C_SDR1     = 1U,         /**< I3C mode transfer speed - SDR1*/
    CY_I3C_SDR2     = 2U,         /**< I3C mode transfer speed - SDR2*/
    CY_I3C_SDR3     = 3U,         /**< I3C mode transfer speed - SDR3*/
    CY_I3C_SDR4     = 4U,         /**< I3C mode transfer speed - SDR4*/
    CY_I3C_HDR_DDR  = 6U,         /**< I3C mode transfer speed - HDR-DDR */
} cy_en_i3c_data_speed_t;

/** I2C Mode, SDR transfer speeds */
typedef enum
{
    CY_I3C_FMP_I2C  = 0U,      /**< I2C mode transfer speed - Fast Mode Plus */
    CY_I3C_FM_I2C   = 1U,      /**< I2C mode transfer speed - Fast Mode */
} cy_en_i2c_data_speed_t;

/** I3C buffer depths */
typedef enum
{
    CY_I3C_1_WORD_DEPTH = 0U,    /**< Buffer depth of 1 word */
    CY_I3C_4_WORD_DEPTH = 1U,    /**< Buffer depth of 4 words */
    CY_I3C_8_WORD_DEPTH = 2U,    /**< Buffer depth of 8 words */
    CY_I3C_16_WORD_DEPTH = 3U,    /**< Buffer depth of 16 words */
    CY_I3C_32_WORD_DEPTH = 4U,    /**< Buffer depth of 32 words */
    CY_I3C_64_WORD_DEPTH = 5U,    /**< Buffer depth of 64 words */
} cy_en_i3c_buffer_depth_t;

/** I3C Target Reset */
typedef enum
{
    CY_I3C_NO_RESET = 0U,            /**< No Reset on Target Reset Pattern */
    CY_I3C_PERIPHERAL_RESET = 1U,    /**< Reset the I3C Peripheral Only */
    CY_I3C_CHIP_RESET = 2U,          /**< Reset the Whole Target */
} cy_en_i3c_target_reset_t;


/** I3C Activity states specified by ENTAS(x) CCC*/
typedef enum
{
    ActivityState0,  /**< Activity State 0 */
    ActivityState1,  /**< Activity State 1 */
    ActivityState2,  /**< Activity State 2 */
    ActivityState3,  /**< Activity State 3 */
} cy_en_i3c_activity_states_t;

/** \} group_i3c_enums */

/*******************************************************************************
*                              Type Definitions
*******************************************************************************/

/**
* \addtogroup group_i3c_data_structures
* \{
*/

/**
* I3C device IBI structure.
* Defines an IBI event.
*/
typedef struct cy_stc_i3c_ibi
{
    /** IBI event type */
    cy_en_i3c_ibi_type_t event;

    /** Address of the device requesting IBI */
    uint8_t targetAddress;

    /** IBI Status. Indicates the controller response for the received IBI */
    uint32_t status;

    /** IBI Payload size. Indicates the size of the received IBI Payload */
    uint8_t payloadSize;

    /** Below attributes are used only in target mode operations. */

    /** IBI Payload Data. Indicates the IBI Payload, For I3C Target mode max 4 bytes supported */
    uint8_t *payload;

    /** IBI Mandatory Data Byte(MDB). To be sent after IBI */
    uint8_t mdb;
} cy_stc_i3c_ibi_t;

/** I3C CCC response structure for Target mode*/
typedef struct cy_stc_i3c_target_ccc_resp
{
    /** CCC command id */
    uint8_t cmd;

    /** Defining Byte */
    uint8_t db;

    /** data length */
    uint8_t len;

    /** Transaction type receive response */
    bool rxRsp;
} cy_stc_i3c_target_ccc_resp_t;

/**
* Provides the typedef for the callback function called in the
* \ref Cy_I3C_Interrupt to notify the user about occurrences of
* \ref group_i3c_macros_callback_events.
*/
typedef void (* cy_cb_i3c_handle_events_t)(uint32_t event);

/**
* Provides the typedef for the callback function called in the
* \ref Cy_I3C_Interrupt to notify ccc response received by target.
*/
typedef void (* cy_cb_i3c_handle_ccc_response_t)(cy_stc_i3c_target_ccc_resp_t *cccData);

/**
* Provides the typedef for the callback function called in the
* \ref Cy_I3C_Interrupt to notify the user about occurrences of
* \ref group_i3c_macros_callback_events.
*/
typedef void (* cy_cb_i3c_handle_ibi_t)(cy_stc_i3c_ibi_t *event);

/**
* I2C device structure.
* Defines an I2C device.
* It is mandatory to provide I2C device static address and lvr information.
*/
typedef struct cy_stc_i2c_device
{
    /** Static address of the I2C device */
    uint8_t staticAddress;

    /** Legacy Virtual Register */
    uint8_t lvr;
} cy_stc_i2c_device_t;

/**
* I3C device structure.
* Defines an I3C device.
* StaticAddress of the I3C device if provided will be used by the controller
* to initiate the dynamic address assignment procedure through SETDASA.
* Desired I3C dynamic address to be used can be provided, but if set to zero,
* available free address will be assigned to the device by the controller.
*/
typedef struct cy_stc_i3c_device
{
    /** 48 bit provisional ID of I3C device */
    uint64_t provisonalID;

