PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
    /** Device Characteristic Register of I3C device */
    uint8_t dcr;

    /** Bus Characteristic Register of I3C device */
    uint8_t bcr;

    /** Static address of the I3C device if used */
    uint8_t staticAddress;

    /**
    * Desired dynamic address for I3C device.
    * If set to zero, available free address will be assigned by I3C controller.
    */
    uint8_t dynamicAddress;

    /** IBI payload length in bytes of target devices*/
    uint8_t ibipayloadSize;

    /** Max private SDR read length in bytes */
    uint16_t mrl;

    /** Max private SDR write length in bytes */
    uint16_t mwl;

    /** Max read speed information */
    uint8_t maxReadDs;

    /** Max write speed information */
    uint8_t maxWriteDs;

    /** Max read turn-around time in micro -seconds */
    uint8_t maxReadTurnaround[3U];

    /** Supported HDR modes */
    uint8_t HDRCap;

    /** Supports Asynchronous timing mode0 */
    bool ATM0Supported;

    /** Packet Error Check Enabled */
    bool PECEnabled;

    /**
    * Support for HDR Mode.
    * true: HDR modes supported. HDRCap member for the device is valid.
    * false: HDR modes are not supported.
    */
    bool hdrSupport;

    /**
    * Max data speed limitation.
    * true: Limitation on max data speed. maxReadDs, maxWriteDs, maxReadTurnaround members for the device are valid
    * false: No limitation on max data speed
    */
    bool speedLimit;
} cy_stc_i3c_device_t;

/** A local list of devices on the bus */
typedef struct cy_stc_i3c_controller_devlist
{
    /** Identifies the device type */
    bool i2c;

    /** I2C/I3C device descriptor */
    union
    {
        cy_stc_i3c_device_t i3cDevice;
        cy_stc_i2c_device_t i2cDevice;
    };
} cy_stc_i3c_controller_devlist_t;

/** Device Characteristic Table structure */
typedef struct cy_stc_i3c_dev_char
{
    uint32_t LSBProvisionalID; /**< The LSB 32-bit value of provisional ID */
    uint32_t MSBProvisionalID; /**< The MSB 16-bit value of provisional ID */
    uint32_t DCR_BCR;          /**< DCR [7:0] and BCR [15:8] of the I3C device */
    uint32_t dynamicAddress;   /**< Dynamic address [7:0] of the I3C device */
} cy_stc_i3c_dev_char_t;

/** 64-bit CCC structure */
typedef struct cy_stc_i3c_ccc
{
    uint32_t cmdHigh;     /**< cmdHigh */
    uint32_t cmdLow;      /**< cmdLow */
} cy_stc_i3c_ccc_t;

/** I3C bus configuration structure */
typedef struct cy_stc_i3c_config
{
    /** Specifies the mode of I3C controller operation */
    cy_en_i3c_mode_t i3cMode;

    /** Specifies the mode of I3C bus operation */
    cy_en_i3c_bus_mode_t i3cBusMode;

    /** Use the SDMA for Rx/Tx */
    bool useDma;

    /**
    * True - Enables the user to configure data rate related parameters for Controller Mode
    */
    bool manualDataRate;

    /** The frequency of the clock connected to the I3C block in Hz. */
    uint32_t i3cClockHz;

    /** The desired I3C data Rate in Hz. */
    uint32_t i3cSclRate;

    /** Opendrain data rate in Hz. */
    uint32_t openDrainSclRate;

    /** Specifies the number of empty locations(or above) in the Transmit FIFO that triggers the Transmit Buffer Threshold Status interrupt */
    cy_en_i3c_buffer_depth_t txEmptyBufThld;

    /** Specifies the number of entries (or above) in the Receive FIFO that triggers the Receive Buffer Threshold Status interrupt */
    cy_en_i3c_buffer_depth_t rxBufThld;

    /**
    * Controller Mode : Specifies the number of Transmit FIFO filled locations count that triggers the transmission.
    *  Target Mode : Specifies the number of Transmit FIFO filled locations count that triggers the transmission.
    */
    cy_en_i3c_buffer_depth_t txBufStartThld;

    /**
    * Controller Mode : Specifies the number of empty locations count in the Receive FIFO that triggers the reception.
    *  Target Mode : Specifies the number of empty locations count in the Receive FIFO that triggers the transmission.
    */
    cy_en_i3c_buffer_depth_t rxBufStartThld;

    /** Below members are only applicable for the Controller mode */

    /**
    * True - I3C broadcast address (0x7E) is used for private transfer
    */
    bool ibaInclude;

    /** Specifies whether the Controller ACK/NACK the Hot-Join request from Target */
    bool hotJoinCtrl;

    /** Specifies the device Dynamic Address */
    uint8_t dynamicAddr;

    /** Specifies the number of empty locations(or greater) in the Command Queue that triggers the Command Queue Ready Status interrupt */
    uint32_t cmdQueueEmptyThld;

    /** Specifies the number of entries(or greater) in the Response Queue that triggers the Response Queue Ready Status interrupt */
    uint32_t respQueueThld;

    /** Specifies the number of IBI status entries(or greater) in the IBI Queue that triggers the IBI Buffer Threshold Status interrupt */
    uint32_t ibiQueueThld;

    /** Specifies IBI data segment size in words (4 bytes) that enables the slicing of the incoming IBI data and generate individual status and thereby promotes the cut-through operation in reading out the IBI data. */
    uint32_t ibiDataThld;

    /** SDA hold time (in terms of number of I3C block clock cycles) of the transmit data with respect to the SCL edge in FM, FM+, SDR and DDR speed mode of operations */
    uint8_t sdaHoldTime;

    /**  Specifies    the I3C bus free count value */
    uint16_t busFreeTime;

    /* For Manual Data Rate Control */

    /** I3C Open Drain low count value */
    uint8_t openDrainLowCnt;

    /** I3C Open Drain high count value */
    uint8_t openDrainHighCnt;

    /** I3C Push Pull low count value */
    uint8_t pushPullLowCnt;

    /**  I3C Push Pull high count value */
    uint8_t pushPullHighCnt;

    /**  I2C FM Mode low count value */
    uint8_t i2cFMLowCnt;

    /** I2C FM Mode high count value */
    uint8_t i2cFMHighCnt;

    /** I2C FM Plus Mode low count value */
    uint8_t i2cFMPlusLowCnt;

    /** I2C FM Plus Mode high count value */
    uint8_t i2cFMPlusHighCnt;

    /** I3C Extended Low Count for SDR1 Mode */
    uint8_t extLowCnt1;

    /** I3C Extended Low Count for SDR2 Mode */
    uint8_t extLowCnt2;

    /** I3C Extended Low Count for SDR3 Mode */
    uint8_t extLowCnt3;

    /** I3C Extended Low Count for SDR4 Mode */
    uint8_t extLowCnt4;

    /** I3C Read Termination Bit Low count */
    uint8_t extTerminationLowCnt;

    /** Below members are only applicable for the Target mode */

    /**  Specifies whether the target uses adaptive I2C I3C mode.
    * It is required to be set only if the device is not aware of the type of the bus to which the target controller is connected
    */
    bool adaptiveI2CI3C;

