PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
    /** The static address of the I3C Target Device, if present */
    uint8_t staticAddress;

    /** The Provisional ID of the I3C Target Device */
    uint64_t pid;

    /** The device characteristic value of the I3C Target Device */
    uint8_t dcr;

    /**
    * Max data speed limitation.
    * True: Limitation on max data speed. maxReadDs, maxWriteDs, maxReadTurnaround members for the device are valid
    * False: No limitation on max data speed
    */
    bool speedLimit;

    /**
    * SDR only or SDR and HDR capable
      True: SDR and HDR
      False: SDR only
    */
    bool hdrCapable;

    /** Specifies the Device Role field in Bus Characteristic Register */
    cy_en_i3c_mode_t deviceRoleCap;

    /**
    * Specifies whether the Hot-Join Request Interrupts are allowed on the I3C bus or not
    * When disabled the Target will not initiate Hot-Join and will take part in Address Assignment without initiating Hot-Join
    */
    bool hotjoinEnable;

    /** Specifies the I3C bus available count value */
    uint16_t busAvailTime;

    /** Specifies the I3C bus idle count value */
    uint32_t busIdleTime;

} cy_stc_i3c_config_t;

/** I3C CCC command payload structure */
typedef struct cy_stc_i3c_ccc_payload
{
    /** Payload length */
    uint16_t len;

    /** Payload data */
    void *data;
} cy_stc_i3c_ccc_payload_t;

/** I3C CCC command structure */
typedef struct cy_stc_i3c_ccc_cmd
{
    /** CCC command id */
    uint8_t cmd;

    /** Defining Byte Present*/
    bool dbp;

    /** Defining Byte */
    uint8_t db;

    /** CCC command payload or NULL */
    cy_stc_i3c_ccc_payload_t *data;

    /** Destination address */
    uint8_t address;
} cy_stc_i3c_ccc_cmd_t;

/** I3C Controller information */
typedef struct cy_stc_i3c_controller
{
    /** Two bits per address to depict the status of the addresses - 8*4*8 */
    unsigned long addrslotsStatusArray[((CY_I3C_MAX_ADDR + 1U) * 2U) / CY_I3C_BITS_PER_LONG];

    /** immediate last address, from the address list, assigned as dynamic address to the target device  */
    uint8_t lastAddress;

    /** Index of the free position with respect to the Device Address Table */
    uint32_t freePos;

    /** The number of devices on the bus */
    uint32_t devCount;

    /** Count of I2C devices on the bus */
    uint32_t i2cDeviceCount;

    /** Number of dynamically addressed devices */
    uint32_t dynAddrDevCount;
} cy_stc_i3c_controller_t;

/** I3C HDR command Structure */
typedef struct cy_stc_i3c_hdr_cmd
{
    /**
    * Command opcode. Bit 7 encodes the direction of the data transfer, if
    * set this is a read, otherwise this is a write.
    */
    uint8_t code;

    /** Number of data words (a word is 16bits wide) to transfer */
    uint32_t ndatawords;

    /** Input/Output buffer */
    union
    {
        uint16_t *in;
        const uint16_t *out;
    } data;
} cy_stc_i3c_hdr_cmd_t;


/**
* I3C context structure.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct cy_stc_i3c_context
{
    /** \cond INTERNAL */

    volatile uint32_t state;    /**< The driver state */
    cy_en_i3c_mode_t i3cMode;   /** Specifies the mode of i3c controller operation */
    cy_en_i3c_bus_mode_t i3cBusMode;     /** Specifies the mode of i3c bus operation */
    bool Enabled;     /** Specifies whether the I3C is enabled for operations. */

    uint32_t i3cSclRate;
    uint32_t i3cClockHz;

    uint32_t openDrainSclRate;    /**< Opendrain data rate in Hz */

    volatile uint32_t controllerStatus; /**< The controller status */

    uint8_t  *controllerBuffer;     /**< The pointer to the controller buffer (either for a transmit or a receive operation) */
    uint32_t  controllerBufferSize;         /**< The current controller buffer size */
    volatile uint32_t controllerBufferIdx;  /**< The current location in the controller buffer */
    volatile uint8_t destDeviceAddr; /**< The destination device address in the transfers */

    volatile uint32_t targetStatus;       /**< The target status */
    volatile bool     targetRdBufEmpty;   /**< Tracks target Read buffer empty event */

    uint8_t  *targetTxBuffer;             /**< The pointer to the target transmit buffer (a controller reads from it) */
    uint32_t  targetTxBufferSize;         /**< The current target transmit buffer size */
    volatile uint32_t targetTxBufferIdx;  /**< The current location in the target buffer */
    volatile uint32_t targetTxBufferCnt;  /**< The number of transferred bytes */

    uint8_t  *targetRxBuffer;             /**< The pointer to the target receive buffer (a controller writes into it) */
    uint32_t  targetRxBufferSize;         /**< The current target receive buffer size */
    volatile uint32_t targetRxBufferIdx;  /**< The current location in the target buffer */
    volatile uint32_t targetRxBufferCnt;

    cy_stc_i3c_controller_t i3cController;       /**< I3C Controller bus details */

    cy_stc_i3c_config_t dsConfig;         /**< I3C Config for DS wake up restore */
    uint32_t intr_mask;                   /**< Interrupt mask for DS wake up restore */
    cy_stc_i3c_controller_devlist_t devList[CY_I3C_MAX_DEVS]; /**< The list of devices on the bus */

    cy_stc_i3c_hdr_cmd_t *hdrCmd; /** <Maintains the HDR command sent */

    uint8_t deftgts_count; /** < Maintains count of targets received during DEFTGTS CCC */

    /**
    * The pointer to an event callback that is called when any of
    * \ref group_i3c_macros_callback_events occurs
    */
    cy_cb_i3c_handle_events_t cbEvents;

    /**
    * The pointer to a ccc response event callback that is called when target gets ccc response.
    */
    cy_cb_i3c_handle_ccc_response_t cccRespEvents;

    /**
    * The pointer to an event callback that is called when any of
    * \ref group_i3c_macros_ibi_events occurs
    */
    cy_cb_i3c_handle_ibi_t    cbIbi;

    /*Asynchronous Timing Mode0 Enabled*/
    bool ATM0Enabled;

    /*Packet Error Check Enabled*/
    bool PECEnabled;

