PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
/*******************************************************************************
*                     In-line Function Implementation
*******************************************************************************/

/** \} group_i3c_target_functions */

/**
* \addtogroup group_i3c_secondary_controller_functions
* \{
*/

#if CY_IP_MXI3C_VERSION_MINOR == 1u || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_I3C_Target_GetResetMode
****************************************************************************//**
*
* Returns the target reset mode set by RSTACT.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Target Reset mode in \ref cy_en_i3c_target_reset_t
*
*******************************************************************************/
__STATIC_INLINE cy_en_i3c_target_reset_t Cy_I3C_Target_GetResetMode(cy_stc_i3c_context_t *context)
{
    return context->resetMode;
}

/*******************************************************************************
* Function Name: Cy_I3C_Target_isTIREnabled
****************************************************************************//**
*
* Returns if Target interrupt request IBI is enabled/disabled by ENEC/DISEC CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* boolean status of TIR enabled.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_I3C_Target_isTIREnabled(I3C_CORE_Type *base)
{
    return (bool)_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_TIR_EN, I3C_CORE_TGT_EVENT_STATUS(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_Target_isHJEnabled
****************************************************************************//**
*
* Returns if HotJoin IBI is enabled/disabled by ENEC/DISEC CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* boolean status of HJ enabled.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_I3C_Target_isHJEnabled(I3C_CORE_Type *base)
{
    return (bool)_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_HJ_EN, I3C_CORE_TGT_EVENT_STATUS(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_Target_isCREnabled
****************************************************************************//**
*
* Returns if Controllership request IBI is enabled/disabled by ENEC/DISEC CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* boolean status of CR enabled.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_I3C_Target_isCREnabled(I3C_CORE_Type *base)
{
    return (bool)_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_CR_EN, I3C_CORE_TGT_EVENT_STATUS(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_Target_getActivityState
****************************************************************************//**
*
* Returns Activity State set by ENTAS(x) CCC.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Activity state value.
*
*******************************************************************************/
__STATIC_INLINE cy_en_i3c_activity_states_t Cy_I3C_Target_getActivityState(I3C_CORE_Type *base)
{
    return (cy_en_i3c_activity_states_t)_FLD2VAL(I3C_CORE_TGT_EVENT_STATUS_ACTIVITY_STATE, I3C_CORE_TGT_EVENT_STATUS(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_Target_getTIRRemainingDataLength
****************************************************************************//**
*
* Returns the number of bytes remaining that was not transmitted in TIR,
* because of controller early terminating the TIR transfer.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Number of bytes remaining in terminated TIR transfer.
*
* \note
* This function can be called after CY_I3C_TARGET_IBI_EARLY_STOP_EVENT event.
* To get number of bytes that are not transmitted.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_I3C_Target_getTIRRemainingDataLength(I3C_CORE_Type *base)
{
    return (uint8_t)_FLD2VAL(I3C_CORE_TGT_IBI_RESP_TIR_RESP_DATA_LENGTH, base->TGT_IBI_RESP);
}
#endif
/** \} group_i3c_target_functions */

/**
* \addtogroup group_i3c_general_functions
* \{
*/
/*******************************************************************************
* Function Name: Cy_I3C_GetInterruptStatus
****************************************************************************//**
*
* Returns the interrupt request register. This register contains the current
* status of the interrupt sources.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* The current status of the interrupt sources.
* Each constant is a bit field value. The value returned may have multiple
* bits set to indicate the current status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetInterruptStatus(I3C_CORE_Type *base)
{
    return (I3C_CORE_INTR_STATUS(base) & CY_I3C_INTR_MASK);
}

/*******************************************************************************
* Function Name: Cy_I3C_ClearInterrupt
****************************************************************************//**
*
* Clears the interrupt sources in the interrupt request register.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* Interrupt sources to be cleared.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_ClearInterrupt(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_STATUS(base) = interruptMask;
}

