PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_i3c.h
/*******************************************************************************
* Function Name: Cy_I3C_SetInterrupt
****************************************************************************//**
*
* Sets interrupt sources in the interrupt request register.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* The interrupt sources to set in the interrupt request register.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetInterrupt(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_FORCE(base) = interruptMask;
}

/*******************************************************************************
* Function Name: Cy_I3C_GetInterruptMask
****************************************************************************//**
*
* Returns the interrupt signal enable register.
* This register specifies which bits from the interrupt request register
* can trigger an interrupt event.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetInterruptMask(I3C_CORE_Type *base)
{
    return (I3C_CORE_INTR_SIGNAL_EN(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_SetInterruptMask
****************************************************************************//**
*
* Writes the I3C interrupt signal enable register.
* This register specifies which bits
* from the I3C interrupt request register can trigger an interrupt event.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* Enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetInterruptMask(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_SIGNAL_EN(base) = interruptMask;

}

/*******************************************************************************
* Function Name: Cy_I3C_GetInterruptStatusMask
****************************************************************************//**
*
* Returns the interrupt status enable register.
* This register specifies which bits from the interrupt request register
* can generate interrupt.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetInterruptStatusMask(I3C_CORE_Type *base)
{
    return (I3C_CORE_INTR_STATUS_EN(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_SetInterruptStatusMask
****************************************************************************//**
*
* Writes the I3C interrupt status enable register. This register specifies which bits
* from the I3C interrupt request register can trigger an interrupt event.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* Enabled I3C interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetInterruptStatusMask(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_STATUS_EN(base) = interruptMask;
}

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 18.1', 3, 'Use of pointer as array.')

/*******************************************************************************
*  Function Name: Cy_I3C_WriteIntoDeviceAddressTable
****************************************************************************//**
*
* Writes the value into the specified location of the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \param value
* The value to be written at the specified location in the DAT.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_WriteIntoDeviceAddressTable(I3C_CORE_Type *base, uint8_t index, uint32_t value)
{
    volatile uint32_t *ptr;
    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));
    ptr = ptr + index;
    *ptr = value;
}

/*******************************************************************************
* Function Name: Cy_I3C_ReadFromDeviceAddressTable
****************************************************************************//**
*
* Returns the complete DAT entry of given index.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \return
* The dynamic address of the I3C device.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_ReadFromDeviceAddressTable(I3C_CORE_Type *base, uint8_t index)
{
    volatile uint32_t *ptr;

    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));
    ptr = ptr + index;
    return (*ptr);
}

/*******************************************************************************
* Function Name: Cy_I3C_ReadDynAddrFromDAT
****************************************************************************//**
*
* Returns the dynamic address of the I3C device stored in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \return
* The dynamic address of the I3C device.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_ReadDynAddrFromDAT(I3C_CORE_Type *base, uint8_t index)
{
    volatile uint32_t *ptr;
    uint32_t addr;

    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));
    ptr = ptr + index;
    addr = _FLD2VAL(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, *ptr);

    return (0x7FUL & addr);
}

/*******************************************************************************
* Function Name: Cy_I3C_ReadStaticAddrFromDAT
****************************************************************************//**
* Returns the static address of the I2C device stored in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \return
* The static address of the I2C device.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_ReadStaticAddrFromDAT(I3C_CORE_Type *base, uint8_t index)
{
    volatile uint32_t *ptr;

    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));
    ptr = ptr + index;

    return ((*ptr) & I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR_Msk);
}
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 18.1')

